package multiplicationtable;

/**
 * Created by Yuriy on 21.02.2016.
 */
public class MultiplicationTable {
    public static void main(String[] args) {
        int i = 1; // ініціалізуємо один множник
        int j = 1; // ініціалізуємо другий множник
        for (i = 1; i <= 9; i++) { //для кожного значення і від 1 до 9 збільшуємо його значення на одиницю на кожному етапі
            for (j = 1; j <= 9; j++) { //для кожного значення j від 1 до 9 збільшуємо його значення на одиницю на кожному етапі
                System.out.print(i * j + " "); //добуток цих твох множників на кожному етапі
            }
            System.out.println();//після проходження одного циклу по і перекидаємо на наступний рядок
        }
    }
}

